# Scientific Python

In [1]:
import numpy as np
import pandas as pd

## Numpy arrays (ndarray)

In [2]:
# ValueError: negative dimensions are not allowed
# a = np.zeros((-1, 2, 3))
# a

In [3]:
ValueError.__mro__

(ValueError, Exception, BaseException, object)

In [4]:
e = ValueError("some error")
e

ValueError('some error')

In [5]:
isinstance(e, (ValueError, Exception, BaseException, object))

True

In [6]:
values = np.linspace(0, 2*np.pi, 10_000)
values

array([0.00000000e+00, 6.28381369e-04, 1.25676274e-03, ...,
       6.28192854e+00, 6.28255693e+00, 6.28318531e+00])

In [7]:
values.shape

(10000,)

In [8]:
values.dtype

dtype('float64')

In [9]:
values.flags

  C_CONTIGUOUS : True
  F_CONTIGUOUS : True
  OWNDATA : False
  WRITEABLE : True
  ALIGNED : True
  WRITEBACKIFCOPY : False

In [10]:
# AttributeError: 'numpy.ndarray' object has no attribute 'note'
# values.note = "beautiful array"

In [11]:
# AttributeError: attribute 'flags' of 'numpy.ndarray' objects is not writable
# del values.flags

In [12]:
# AttributeError: Cannot delete array shape
# del values.shape

In [13]:
values.shape = (10, 1000)
values

array([[0.00000000e+00, 6.28381369e-04, 1.25676274e-03, ...,
        6.26496225e-01, 6.27124606e-01, 6.27752987e-01],
       [6.28381369e-01, 6.29009750e-01, 6.29638132e-01, ...,
        1.25487759e+00, 1.25550597e+00, 1.25613436e+00],
       [1.25676274e+00, 1.25739112e+00, 1.25801950e+00, ...,
        1.88325896e+00, 1.88388734e+00, 1.88451573e+00],
       ...,
       [4.39866958e+00, 4.39929796e+00, 4.39992634e+00, ...,
        5.02516581e+00, 5.02579419e+00, 5.02642257e+00],
       [5.02705095e+00, 5.02767933e+00, 5.02830771e+00, ...,
        5.65354718e+00, 5.65417556e+00, 5.65480394e+00],
       [5.65543232e+00, 5.65606070e+00, 5.65668908e+00, ...,
        6.28192854e+00, 6.28255693e+00, 6.28318531e+00]])

In [14]:
# ValueError: cannot reshape array of size 10000 into shape (1000,1000)
# values.shape = (1000, 1000)

## Pandas DataFrame

In [15]:
cities = pd.read_csv('Iteration/cities.csv', encoding='UTF-8')
cities

       name  population     cp
0       Pau       77000  64000
1  Toulouse      477000  31000
2     Nîmes      150000  30000

In [16]:
cities.population

0     77000
1    477000
2    150000
Name: population, dtype: int64

In [17]:
cities.name

0         Pau
1    Toulouse
2       Nîmes
Name: name, dtype: object

In [18]:
cities.drop(columns='population', inplace=True)
cities

       name     cp
0       Pau  64000
1  Toulouse  31000
2     Nîmes  30000

In [19]:
# AttributeError: 'DataFrame' object has no attribute 'population'
# cities.population

In [20]:
cities.note = "Beautiful dataframe"

In [21]:
cities.columns = ['city_name', 'zipcode']
cities

  city_name  zipcode
0       Pau    64000
1  Toulouse    31000
2     Nîmes    30000

In [22]:
# ValueError: Length mismatch: Expected axis has 2 elements, new values have 3 elements
# cities.columns = ['city_name', 'zipcode', 'population']

In [23]:
# NotImplementedError: __delete__
# del cities.columns